Catalogs/ТоварыФотографии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТоварыФотографии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Attachment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Каталог/Ext/Module.bsl
//Возвращает JSON для template
Функция СформироватьСписокТоваров(НаименованиеВидаНоменклатуры) Экспорт  
	СписокТоваров = ПолучитьСписокНоменклатуры(НаименованиеВидаНоменклатуры);
	Элементы = Новый Массив;
	Для каждого Товар Из СписокТоваров Цикл
		Если Товар.Свойство("Наименование") Тогда
		    НаименованиеТовара = ?(ЗначениеЗаполнено(Товар.Наименование), Товар.Наименование, "Без наименования");
		Иначе
		    НаименованиеТовара = "Без наименования";
		КонецЕсли;

		Если Товар.Свойство("Описание") Тогда
		    ОписаниеТовара = ?(ЗначениеЗаполнено(Товар.Описание), Товар.Описание, "Описание есть, товара нет");
		Иначе
		    ОписаниеТовара = "Свойства описание нет";
		КонецЕсли;

		Если Товар.Свойство("Артикул") Тогда
		    АртикулТовара = ?(ЗначениеЗаполнено(Товар.Артикул), Товар.Артикул, "нет_артикула");
		Иначе
		    АртикулТовара = "нет_артикула";
		КонецЕсли;	        
		
		Элементы.Добавить(
		    Клавиатура.СоздатьЭлемент(
			    НаименованиеТовара,    // title
		        ОписаниеТовара,        // description
		        "callback",            // type кнопки
		        "Добавить",            // label кнопки
		        АртикулТовара,         // payload кнопки  
				"open_photo",
				Товар.Фотография
		   )
		);
	КонецЦикла;   
	 
	//Карусель = Новый Структура;
	//Карусель.Вставить("type", "carousel");
	//Карусель.Вставить("elements", Элементы);
	//  
	//СтрКарусели = ФункцииJSON.СформироватьJSON(Карусель);
	    
    Возврат Элементы;	
КонецФункции                        

Функция ПолучитьВидыНоменклатуры() Экспорт 
	Выборка = Справочники.ВидыНоменклатурыДляБота.Выбрать();
	Список = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.ВидНоменклатуры);
	КонецЦикла;
	Возврат Список;
КонецФункции

// Функция возвращает Массив структур {НаименованиеПолное, Описание, Артикул}
Функция ПолучитьСписокНоменклатуры(НаименованиеВида)    
	Вид = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(НаименованиеВида);
	//Если ВыбранныеВиды.Количество() = 0 Тогда
	//	Возврат Новый Массив;
	//КонецЕсли;
    // 1) Формируем запрос по справочнику Номенклатура и регистру цен
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	 | Ном.Ссылка       КАК Ссылка,
	 | Ном.Наименование КАК Наименование,
	 | Ном.Описание     КАК Описание,
	 | Ном.Артикул      КАК Артикул,
	 | Фот.Attachment   КАК Фотография
	 |ИЗ
	 | Справочник.Номенклатура КАК Ном  
	 | ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТоварыФотографии КАК Фот
     |       ПО Ном.Ссылка = Фот.Номенклатура
	 |ГДЕ 
	 | Ном.ВидНоменклатуры = &Вид";
	 //| Ном.ВидНоменклатуры = &ВидКартины
	 //| ИЛИ Ном.ВидНоменклатуры = &ВидУслуги";
		
	Запрос.УстановитьПараметр("Вид", Вид);
	//Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги"));
	
	// 3) выполняем и перебираем выборку
    Результат = Запрос.Выполнить().Выбрать();
    Список  = Новый Массив;    
	
	Пока Результат.Следующий() Цикл   
		Наименование = ?(СтрДлина(Результат.Наименование) > 80, Лев(Результат.Наименование, 80), Результат.Наименование);  
		Описание = ?(СтрДлина(Результат.Описание) > 80, Лев(Результат.Описание, 80), Результат.Описание);  
		
		Стр = Новый Структура;
		Стр.Вставить("Наименование", Наименование);
		Стр.Вставить("Описание", Описание);
		Стр.Вставить("Артикул", Результат.Артикул);
		Стр.Вставить("Фотография", Результат.Фотография);   
		
		Список.Добавить(Стр);
	КонецЦикла; 
	
    Возврат Список;
КонецФункции

Функция РазбитьНаСтраницы(СписокТоваров)
	
КонецФункции

Функция ПолучитьЦену(СсылкаНоменклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	| Цены.Цена как Цена
	|ИЗ
	| РегистрСведений.ЦеныНоменклатуры25 КАК Цены
	|ГДЕ
	| Цены.Номенклатура = &Номенклатура
	|УПОРЯДОЧИТЬ ПО 
	| Цены.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", СсылкаНоменклатура);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	КонецЕсли;
	
	Возврат 0;
КонецФункции   

// Ищет в справочнике «Номенклатура» элемент по значению реквизита «Артикул».
// Если не найдено — возвращает Неопределено.
Функция НайтиПоАртикулу(Знач Артикул) Экспорт
    Если ЗначениеЗаполнено(Артикул) = Ложь Тогда 
        Возврат Неопределено;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Ном.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Номенклатура КАК Ном
    |ГДЕ
    |   Ном.Артикул = &Артикул";
    Запрос.УстановитьПараметр("Артикул", Артикул);

    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.Ссылка;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции
